---
kind: method
id: M:Autodesk.Revit.DB.TransactWithCentralOptions.Dispose
source: html/78d4bd05-a40c-57f5-b49c-ee564de352a1.htm
---
# Autodesk.Revit.DB.TransactWithCentralOptions.Dispose Method

Releases all resources used by the TransactWithCentralOptions

## Syntax (C#)
```csharp
public void Dispose()
```